In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.offline as pyo
import plotly.graph_objs as go
import math
from scipy.stats import t
%matplotlib inline

# Visualization

In [2]:
df = pd.read_csv('6010502543_Assignment_1_Data.csv')
df

    Day  Food expenses  Travel expenses  Other expenses
0     9             94               28             121
1    10            113                0               0
2    11            359                0               0
3    12            100                0               0
4    13             80               28               0
5    14            372               28               0
6    15            130               29               0
7    16            176               28              69
8    17            590               31               0
9    18            460               16             657
10   19            137               15               0
11   20            127               27               0
12   21            210               27            1000
13   22            157               15               0

In [3]:
df.set_index('Day', inplace=True)
df

     Food expenses  Travel expenses  Other expenses
Day
9               94               28             121
10             113                0               0
11             359                0               0
12             100                0               0
13              80               28               0
14             372               28               0
15             130               29               0
16             176               28              69
17             590               31               0
18             460               16             657
19             137               15               0
20             127               27               0
21             210               27            1000
22             157               15               0

In [4]:
trace1 = go.Scatter(x=df.index,
                    y=df['Food expenses'],
                    mode='lines+markers',
                    name='Food expenses')
data = [trace1]

In [5]:
layout = go.Layout(title = {'text':'Food expenses between 09-22 Jan 2022',
                            'font' : {'size':20}},
                   xaxis = {'title':{'text':'Date',
                                     'font' : {'size':16}},
                            'tickfont' : {'size':14}},
                   yaxis = {'title':{'text':'Baht',
                                     'font' : {'size':16}},
                            'tickfont' : {'size':14},
                            'range': [0,100]}, 
                   hovermode='closest',
                   )

In [6]:
fig = go.Figure(data=data, layout=layout)
pyo.plot(fig)

'temp-plot.html'

In [7]:
trace1 = go.Scatter(x=df.index,
                    y=df['Travel expenses'],
                    mode='lines+markers',
                    name='Travel expenses')
data = [trace1]

layout = go.Layout(title = {'text':'Travel expenses between 09-22 Jan 2022',
                            'font' : {'size':20}},
                   xaxis = {'title':{'text':'Date',
                                     'font' : {'size':16}},
                            'tickfont' : {'size':14}},
                   yaxis = {'title':{'text':'Baht',
                                     'font' : {'size':16}},
                            'tickfont' : {'size':14},
                            'range': [0,40]}, 
                   hovermode='closest',
                   )

fig = go.Figure(data=data, layout=layout)
pyo.plot(fig)

'temp-plot.html'

In [8]:
trace1 = go.Bar(x=df.index,
                    y=df['Food expenses'],
                    name='Food expenses')
trace2 = go.Bar(x=df.index,
                    y=df['Travel expenses'],
                    name='Travel expenses')
trace3 = go.Bar(x=df.index,
                    y=df['Other expenses'],
                    name='Other expenses')
data = [trace1, 
        trace2,
        trace3]

In [9]:
layout = go.Layout(title = {'text':'Expenses between 09-22 Jan 2022',
                            'font' : {'size':20}},
                   xaxis = {'title':{'text':'Date',
                                     'font' : {'size':16}},
                            'tickfont' : {'size':14}},
                   yaxis = {'title':{'text':'Baht',
                                     'font' : {'size':16}},
                            'tickfont' : {'size':14}}, 
                   hovermode='closest',
                   barmode='stack',
                  )
fig = go.Figure(data=data,layout=layout)
pyo.plot(fig)

'temp-plot.html'

In [10]:
trace = go.Pie(labels=df.columns,
              values=df.iloc[7],
              hoverinfo='label+percent',
              textinfo='value'
             )
data = [trace]

In [11]:
layout = go.Layout(title = {'text':'Expenses on 16 Jan 2020 (Baht)',
                            'font' : {'size':20}},
                   font = {'size':18})

fig = go.Figure(data=data, layout=layout)
pyo.plot(fig)

'temp-plot.html'

In [12]:
trace =go.Pie(labels=df.columns,
              values=df.iloc[9],
              hoverinfo='label+percent',
              textinfo='value'
             )
data = [trace]

In [13]:
layout = go.Layout(title = {'text':'Expenses on 18 Jan 2020 (Baht)',
                            'font' : {'size':20}},
                   font = {'size':18})

fig = go.Figure(data=data, layout=layout)
pyo.plot(fig)

'temp-plot.html'

In [14]:
df2 = pd.read_csv('6010502543_Assignment_1_Data_Deviation.csv')
df2

    Day  Food expenses  Travel expenses
0    10             19              -28
1    11            246                0
2    12           -259                0
3    13            -20               28
4    14            292                0
5    15           -242                1
6    16             46               -1
7    17            414                3
8    18           -130              -15
9    19           -323               -1
10   20            -10               12
11   21             83                0
12   22            -53              -12

In [15]:
df2.set_index('Day', inplace=True)
df2

     Food expenses  Travel expenses
Day
10              19              -28
11             246                0
12            -259                0
13             -20               28
14             292                0
15            -242                1
16              46               -1
17             414                3
18            -130              -15
19            -323               -1
20             -10               12
21              83                0
22             -53              -12

In [16]:
trace1 = go.Bar(x=df2.index,
                    y=df2['Food expenses'],
                    name='Food expenses')
data = [trace1]

In [17]:
layout = go.Layout(title = {'text':'Food expenses compared to the previous day',
                            'font' : {'size':20}},
                   xaxis = {'title':{'text':'Date',
                                     'font' : {'size':16}},
                            'tickfont' : {'size':14}},
                   yaxis = {'title':{'text':'Baht',
                                     'font' : {'size':16}},
                            'tickfont' : {'size':14}}, 
                   hovermode='closest')
fig = go.Figure(data=data,layout=layout)
pyo.plot(fig)

'temp-plot.html'

In [18]:
trace1 = go.Bar(x=df2.index,
                    y=df2['Travel expenses'],
                    name='Travel expenses')
data = [trace1]

layout = go.Layout(title = {'text':'Travel expenses compared to the previous day',
                            'font' : {'size':20}},
                   xaxis = {'title':{'text':'Date',
                                     'font' : {'size':16}},
                            'tickfont' : {'size':14}},
                   yaxis = {'title':{'text':'Baht',
                                     'font' : {'size':16}},
                            'tickfont' : {'size':14}}, 
                   hovermode='closest')
fig = go.Figure(data=data,layout=layout)
pyo.plot(fig)

'temp-plot.html'

# Hypothesis test

In [19]:
df3 = pd.read_csv('6010502543_Assignment_1_Data_Weekday-Weekend.csv')
df3

    Day  Food expenses  Travel expenses  Other expenses Weekend_or_Weekday
0     9             94               28             121            Weekday
1    10            113                0               0            Weekday
2    11            359                0               0            Weekend
3    12            100                0               0            Weekend
4    13             80               28               0            Weekday
5    14            372               28               0            Weekday
6    15            130               29               0            Weekday
7    16            176               28              69            Weekday
8    17            590               31               0            Weekday
9    18            460               16             657            Weekend
10   19            137               15               0            Weekend
11   20            127               27               0            Weekday
12   21            210               27            1000            Weekday
13   22            157               15               0            Weekday

In [20]:
df3.describe()

           Day  Food expenses  Travel expenses  Other expenses
count  14.0000      14.000000        14.000000       14.000000
mean   15.5000     221.785714        19.428571      131.928571
std     4.1833     158.805240        11.823798      304.754495
min     9.0000      80.000000         0.000000        0.000000
25%    12.2500     116.500000        15.000000        0.000000
50%    15.5000     147.000000        27.000000        0.000000
75%    18.7500     321.750000        28.000000       51.750000
max    22.0000     590.000000        31.000000     1000.000000

In [21]:
df_weekday = df3[df3.Weekend_or_Weekday=='Weekday']
df_weekday

    Day  Food expenses  Travel expenses  Other expenses Weekend_or_Weekday
0     9             94               28             121            Weekday
1    10            113                0               0            Weekday
4    13             80               28               0            Weekday
5    14            372               28               0            Weekday
6    15            130               29               0            Weekday
7    16            176               28              69            Weekday
8    17            590               31               0            Weekday
11   20            127               27               0            Weekday
12   21            210               27            1000            Weekday
13   22            157               15               0            Weekday

In [22]:
df_weekend = df3[df3.Weekend_or_Weekday=='Weekend']
df_weekend

    Day  Food expenses  Travel expenses  Other expenses Weekend_or_Weekday
2    11            359                0               0            Weekend
3    12            100                0               0            Weekend
9    18            460               16             657            Weekend
10   19            137               15               0            Weekend

In [23]:
df_weekday.describe()

             Day  Food expenses  Travel expenses  Other expenses
count  10.000000      10.000000          10.0000       10.000000
mean   15.700000     204.900000          24.1000      119.000000
std     4.423423     158.955934           9.5038      312.301848
min     9.000000      80.000000           0.0000        0.000000
25%    13.250000     116.500000          27.0000        0.000000
50%    15.500000     143.500000          28.0000        0.000000
75%    19.250000     201.500000          28.0000       51.750000
max    22.000000     590.000000          31.0000     1000.000000

In [24]:
df_weekend.describe()

             Day  Food expenses  Travel expenses  Other expenses
count   4.000000       4.000000         4.000000            4.00
mean   15.000000     264.000000         7.750000          164.25
std     4.082483     173.652911         8.958236          328.50
min    11.000000     100.000000         0.000000            0.00
25%    11.750000     127.750000         0.000000            0.00
50%    15.000000     248.000000         7.500000            0.00
75%    18.250000     384.250000        15.250000          164.25
max    19.000000     460.000000        16.000000          657.00

In [25]:
meanx = df_weekday["Food expenses"].mean()
meanx

204.9

In [26]:
meany = df_weekend["Food expenses"].mean()
meany

264.0

In [27]:
stdx = df_weekday["Food expenses"].std()
stdx

158.95593379578156

In [28]:
stdy = df_weekend["Food expenses"].std()
stdy

173.6529105236458

In [29]:
countx = df_weekday["Food expenses"].count()
countx

10

In [30]:
county = df_weekend["Food expenses"].count()
county

4

In [31]:
mean = meanx-meany
mean

-59.099999999999994

In [32]:
sd = np.sqrt((pow(stdx,2)/countx)+(pow(stdy,2)/county))
sd

100.32712605383563

In [33]:
test_statistics = (mean-0)/sd
test_statistics

-0.5890729887776002

In [34]:
x = (pow(stdx,2)/countx)
y = (pow(stdy,2)/county)

In [35]:
degree_of_freedom = math.floor(pow(x+y,2)/((pow(x,2)/countx-1)+(pow(y,2)/county-1)))
degree_of_freedom

6

In [36]:
alpha = 0.05/2
t.ppf(1-alpha, degree_of_freedom)

2.4469118487916806

# Anova on single factor

In [37]:
df4 = pd.read_csv("6010502543_Assignment_1_Data_TravelExpenses_shared.csv")
df4

    Motocycle Expense (Baht)  Bus Expense (Baht)  BTS Expense (Baht)
0                       15.0                  13                43.0
1                       10.0                  15                43.0
2                       10.0                  13                15.0
3                       10.0                  15                26.0
4                       10.0                  14                10.0
5                       40.0                  14                10.0
6                       13.0                  14                10.0
7                       10.0                  15                10.0
8                       20.0                  13                10.0
9                       15.0                  15                44.0
10                      10.0                   8                53.0
11                      20.0                   8                44.0
12                      40.0                   8                44.0
13                      40.0                   8                44.0
14                      20.0                  14                44.0
15                      10.0                   1                44.0
16                      12.0                  13                 NaN
17                      12.0                  14                 NaN
18                      12.0                  14                 NaN
19                      12.0                  13                 NaN
20                      12.0                  14                 NaN
21                      15.0                   1                 NaN
22                      15.0                  15                 NaN
23                      15.0                  15                 NaN
24                      15.0                  20                 NaN
25                      15.0                  20                 NaN
26                      15.0                  20                 NaN
27                      15.0                  15                 NaN
28                      15.0                  15                 NaN
29                      15.0                  14                 NaN
30                      15.0                  11                 NaN
31                      15.0                   8                 NaN
32                      15.0                   7                 NaN
33                      15.0                   8                 NaN
34                      15.0                  15                 NaN
35                      15.0                  10                 NaN
36                      15.0                  15                 NaN
37                      15.0                  15                 NaN
38                      30.0                  15                 NaN
39                      15.0                  20                 NaN
40                      15.0                  15                 NaN
41                      15.0                  20                 NaN
42                      30.0                  15                 NaN
43                      20.0                  20                 NaN
44                      40.0                  15                 NaN
45                      15.0                  18                 NaN
46                      10.0                  18                 NaN
47                      15.0                  18                 NaN
48                      10.0                  18                 NaN
49                      15.0                  20                 NaN
50                      10.0                  15                 NaN
51                       NaN                  15                 NaN
52                       NaN                  25                 NaN
53                       NaN                  50                 NaN
54                       NaN                  25                 NaN
55                       NaN                  80                 NaN
56                       NaN                  80                 NaN

In [38]:
stacked_data = df4.stack().reset_index()
stacked_data = stacked_data.rename(columns={'level_0': 'id',
                                            'level_1': 'travel_by',
                                            0:'baht'})
stacked_data

     id                 travel_by  baht
0     0  Motocycle Expense (Baht)  15.0
1     0        Bus Expense (Baht)  13.0
2     0        BTS Expense (Baht)  43.0
3     1  Motocycle Expense (Baht)  10.0
4     1        Bus Expense (Baht)  15.0
..   ..                       ...   ...
119  52        Bus Expense (Baht)  25.0
120  53        Bus Expense (Baht)  50.0
121  54        Bus Expense (Baht)  25.0
122  55        Bus Expense (Baht)  80.0
123  56        Bus Expense (Baht)  80.0

[124 rows x 3 columns]

In [39]:
from statsmodels.formula.api import ols
results = ols('baht ~ C(travel_by)', data=stacked_data).fit()
results.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                   baht   R-squared:                       0.130
Model:                            OLS   Adj. R-squared:                  0.116
Method:                 Least Squares   F-statistic:                     9.068
Date:                Sun, 21 Feb 2021   Prob (F-statistic):           0.000214
Time:                        16:35:30   Log-Likelihood:                -484.94
No. Observations:                 124   AIC:                             975.9
Df Residuals:                     121   BIC:                             984.4
Df Model:                           2
Covariance Type:            nonrobust
============================================================================================================
                                               coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------------------------------------
Intercept                                   30.8750      3.058     10.096      0.000      24.820      36.930
C(travel_by)[T.Bus Expense (Baht)]         -13.6469      3.461     -3.943      0.000     -20.499      -6.795
C(travel_by)[T.Motocycle Expense (Baht)]   -14.2475      3.505     -4.065      0.000     -21.187      -7.308
==============================================================================
Omnibus:                       90.638   Durbin-Watson:                   1.274
Prob(Omnibus):                  0.000   Jarque-Bera (JB):              676.776
Skew:                           2.495   Prob(JB):                    1.10e-147
Kurtosis:                      13.300   Cond. No.                         5.89
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

In [40]:
import statsmodels.api as sm
aov_table = sm.stats.anova_lm(results, typ=2)
aov_table

                    sum_sq     df         F    PR(>F)
C(travel_by)   2714.035279    2.0  9.067914  0.000214
Residual      18107.706656  121.0       NaN       NaN

In [41]:
from scipy.stats import f
f.ppf(0.95,2,121)

3.071140456982834

In [42]:
1-f.cdf(9.0679,2,121)

0.00021402381039281604

# Anova on two factor

### - in google sheet

In [43]:
df6 = pd.read_csv('6010502543_Assignment_1_Data_FoodExpenses_by_day_of_week.csv')
df6

         Day  Food expenses (lunch)  Food expenses (dinner)
0   thursday                    106                     164
1     friday                    292                     160
2   saturday                    295                     330
3     sunday                    117                     120
4     monday                     67                     140
5    tuesday                    414                     168
6  wednesday                    117                     170

In [44]:
f.ppf(0.95,6,6)

4.283865713822639

In [45]:
f.ppf(0.95,1,6)

5.987377607273699

# Categorical data analysis

In [46]:
from scipy.stats import chi2

In [47]:
1-chi2.cdf(1595.66,12)

0.0

In [48]:
df5 = pd.read_csv('6010502543_Assignment_1_Data_Expenses_by_day_of_week.csv')
df5

         Day  Food expenses  Travel expenses  Other expenses
0   thursday            270               56             190
1     friday            703               31               0
2   saturday            819               16             657
3     sunday            237               15               0
4     monday            207               55               0
5    tuesday            582               55            1000
6  wednesday            287               44               0

In [49]:
df5.set_index('Day', inplace=True)
df5

           Food expenses  Travel expenses  Other expenses
Day
thursday             270               56             190
friday               703               31               0
saturday             819               16             657
sunday               237               15               0
monday               207               55               0
tuesday              582               55            1000
wednesday            287               44               0

In [50]:
from scipy.stats import chi2_contingency
chi2, p, dof, ex = chi2_contingency(df5)

In [51]:
chi2

1595.6600433287576

In [52]:
p

0.0

In [53]:
dof

12

In [54]:
from scipy.stats import chi2
alpha = 0.05
chi2.ppf(1-alpha, dof)

21.02606981748307

In [55]:
1-chi2.cdf(1595.66,12)

0.0